====================
For loop
====================

for fox in sox {
}

---

(source_file
    (for_loop
        name: (variable_name)
        iterable: (reference
            symbol: (symbol)
        )
        block: (block)
    )
)

====================
Variable assignment
====================

x := 1;
x = 2;

---

 (source_file
    (variable_definition
        name: (variable_name)
        value: (number)
    )
    (assignment
        name: (variable_name)
        value: (number)
    )
)

====================
If
====================

if false {}

---

(source_file
    (if
        condition: (bool)
        block: (block)
    )
)

====================
Return
====================

return 1;

---

(source_file
    (return
        expression: (number)
    )
)

====================
Function definition
====================

fn hi(a: number, b: string) -> bool {}

---

(source_file
    (function_definition
        name: (function_name)
        parameter_list: (parameter_list
            (parameter_definition
                name: (parameter)
                type: (primitive_type)
            )
            (parameter_definition
                name: (parameter)
                type: (primitive_type)
            )
        )
        return_type: (primitive_type)
        block: (block)
    )
)

==================================
Function with function parameter
==================================

fn f(callback: (number,number)->bool) -> bool {}

---
(source_file
    (function_definition
        name: (function_name)
        parameter_list: (parameter_list
                (parameter_definition
                    name: (parameter)
                    type: (function_type
                        parameter_types: (parameter_type_list
                            (primitive_type)
                            (primitive_type)
                        )
                        return_type: (primitive_type)
                    )
                )
            )
        return_type: (primitive_type)
        block: (block)
    )
)

==================================
Class definition
==================================

class A {
    fn do_something() {}
    a_member: string;
}

---
(source_file
    (class_definition
        name: (class_name)
        implementation: (class_implementation
            (function_definition
                name: (function_name)
                parameter_list: (parameter_list)
                block: (block)
            )
            (class_member
                name: (variable_name)
                type: (primitive_type)
            )
        )
    )
)

